documentatie/referentie documentatie/voorbeeld-communicatie-portal-guc-osbgw/part-1.txt

POST /services HTTP/1.1
Content-type: text/xml;charset="utf-8"
X-MULE_CORRELATION_ID: a84faeeb-85b6-11de-a884-e53af7138924
X-MULE_ENCODING: UTF-8
X-MULE_ENDPOINT: http://twd720.resource.ta-twd.rotterdam.nl:10080/services
X-MULE_ORIGINATING_ENDPOINT: endpoint.http.localhost.63081.stelselBevragenService
X-MULE_REMOTE_CLIENT_ADDRESS: /127.0.0.1:51975
X-MULE_REMOTE_SYNC: true
Soapaction: "http://wus.tmf.gbo.overheid.nl/wsdl/stelselBevragen/getBasisregistratieListRequest/stelselBevragenService"
User-Agent: Jakarta Commons-HttpClient/3.1
Host: twd720.resource.ta-twd.rotterdam.nl:10080
Content-Length: 767

<?xml version="1.0" ?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Header><To xmlns="http://www.w3.org/2005/08/addressing">http://localhost:63081/stelselBevragenService</To><Action xmlns="http://www.w3.org/2005/08/addressing">http://wus.tmf.gbo.overheid.nl/wsdl/stelselBevragen/getBasisregistratieListRequest/stelselBevragenService</Action><ReplyTo xmlns="http://www.w3.org/2005/08/addressing">
    <Address>http://www.w3.org/2005/08/addressing/anonymous</Address>
</ReplyTo><MessageID xmlns="http://www.w3.org/2005/08/addressing">uuid:c69d5198-1856-485d-a605-e1983995a5cb</MessageID></S:Header><S:Body><getBasisregistratieList xmlns="http://wus.tmf.gbo.overheid.nl/wsdl/stelselBevragen-V1.1.xsd"></getBasisregistratieList></S:Body></S:Envelope>

HTTP/1.1 200 OK
Content-Type: text/plain
Date: Mon, 10 Aug 2009 04:04:10 CEST
Server: Mule Core/1.4.3
Expires: Mon, 10 Aug 2009 04:04:10 CEST
MULE_CORRELATION_ID: a84faeeb-85b6-11de-a884-e53af7138924
MULE_CORRELATION_GROUP_SIZE: -1
MULE_CORRELATION_SEQUENCE: -1
Content-Length: 1357

<soapenv:Envelope xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header><wsa:To>http://www.w3.org/2005/08/addressing/anonymous</wsa:To><wsa:MessageID>uuid:802aea05-4ee8-4818-9882-3fd6f7c39352</wsa:MessageID><wsa:Action>http://wus.tmf.gbo.overheid.nl/wsdl/stelselBevragen/getBasisregistratieListResponse</wsa:Action><wsa:RelatesTo>uuid:c69d5198-1856-485d-a605-e1983995a5cb</wsa:RelatesTo></soapenv:Header><soapenv:Body><getBasisregistratieListResponse xmlns="http://wus.tmf.gbo.overheid.nl/wsdl/stelselBevragen-V1.1.xsd"><basisregistratieList><tag>BRI</tag><naam>Basis Registratie Inkomen</naam></basisregistratieList><basisregistratieList><tag>BR1</tag><naam>Basisregistratie - TMF Test</naam></basisregistratieList><basisregistratieList><tag>GBA</tag><naam>Gemeentelijke Basisregistratie Persoonsgegevens</naam></basisregistratieList><basisregistratieList><tag>BRA</tag><naam>Basis Registratie Adressen</naam></basisregistratieList><basisregistratieList><tag>BGR</tag><naam>Basis Gebouwen Registratie</naam></basisregistratieList><basisregistratieList><tag>WOZ</tag><naam>Basisregistratie WOZ</naam></basisregistratieList><basisregistratieList><tag>BRK</tag><naam>Basisregistratie Kadaster</naam></basisregistratieList></getBasisregistratieListResponse></soapenv:Body></soapenv:Envelope>
