documentatie/referentie documentatie/voorbeeld-communicatie-portal-guc-osbgw/part-4.txt

POST /services HTTP/1.1
Content-type: text/xml;charset="utf-8"
X-MULE_CORRELATION_ID: 13249f26-85b7-11de-a884-e53af7138924
X-MULE_ENCODING: UTF-8
X-MULE_ENDPOINT: http://twd720.resource.ta-twd.rotterdam.nl:10080/services
X-MULE_ORIGINATING_ENDPOINT: endpoint.http.localhost.63081.stelselBevragenService
X-MULE_REMOTE_CLIENT_ADDRESS: /127.0.0.1:45899
X-MULE_REMOTE_SYNC: true
Soapaction: "http://wus.tmf.gbo.overheid.nl/wsdl/stelselBevragen/getObjectInfoRequest/stelselBevragenService"
User-Agent: Jakarta Commons-HttpClient/3.1
Host: twd720.resource.ta-twd.rotterdam.nl:10080
Content-Length: 780

<?xml version="1.0" ?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Header><To xmlns="http://www.w3.org/2005/08/addressing">http://localhost:63081/stelselBevragenService</To><Action xmlns="http://www.w3.org/2005/08/addressing">http://wus.tmf.gbo.overheid.nl/wsdl/stelselBevragen/getObjectInfoRequest/stelselBevragenService</Action><ReplyTo xmlns="http://www.w3.org/2005/08/addressing">
    <Address>http://www.w3.org/2005/08/addressing/anonymous</Address>
</ReplyTo><MessageID xmlns="http://www.w3.org/2005/08/addressing">uuid:444027e5-f3e6-4e3c-b656-9bc624122f57</MessageID></S:Header><S:Body><getObjectInfo xmlns="http://wus.tmf.gbo.overheid.nl/wsdl/stelselBevragen-V1.1.xsd"><BRTag>GBA</BRTag><ObjectTag>01</ObjectTag></getObjectInfo></S:Body></S:Envelope>

HTTP/1.1 200 OK
Content-Type: text/plain
Date: Mon, 10 Aug 2009 04:06:57 CEST
Server: Mule Core/1.4.3
Expires: Mon, 10 Aug 2009 04:06:57 CEST
MULE_CORRELATION_ID: 13249f26-85b7-11de-a884-e53af7138924
MULE_CORRELATION_GROUP_SIZE: -1
MULE_CORRELATION_SEQUENCE: -1
Content-Length: 2794

<soapenv:Envelope xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header><wsa:To>http://www.w3.org/2005/08/addressing/anonymous</wsa:To><wsa:MessageID>uuid:53f3b1df-a234-4837-a554-8e0a72a0aaf1</wsa:MessageID><wsa:Action>http://wus.tmf.gbo.overheid.nl/wsdl/stelselBevragen/getObjectInfoResponse</wsa:Action><wsa:RelatesTo>uuid:444027e5-f3e6-4e3c-b656-9bc624122f57</wsa:RelatesTo></soapenv:Header><soapenv:Body><getObjectInfoResponse xmlns="http://wus.tmf.gbo.overheid.nl/wsdl/stelselBevragen-V1.1.xsd"><objectInfo><ObjectHeaderInfo><tag>01</tag><naam>Natuurlijk Persoon</naam><bevraagbaar>false</bevraagbaar><instructie></instructie></ObjectHeaderInfo><attributen><code>01.01.10</code><naam>A-nummer persoon</naam></attributen><attributen><code>01.01.20</code><naam>Burgerservicenummer persoon</naam></attributen><attributen><code>01.02.10</code><naam>Voornamen persoon</naam></attributen><attributen><code>01.02.20</code><naam>Adellijke titel/predikaat pers</naam></attributen><attributen><code>01.02.30</code><naam>Voorvoegsel geslachtsnaam pers</naam></attributen><attributen><code>01.02.40</code><naam>Geslachtsnaam persoon</naam></attributen><attributen><code>01.03.10</code><naam>Geboortedatum persoon</naam></attributen><attributen><code>01.03.20</code><naam>Geboorteplaats persoon</naam></attributen><attributen><code>01.03.30</code><naam>Geboorteland persoon</naam></attributen><attributen><code>01.04.10</code><naam>Geslachtsaanduiding</naam></attributen><attributen><code>01.20.10</code><naam>Vorig A-nummer</naam></attributen><attributen><code>01.20.20</code><naam>Volgend A-nummer</naam></attributen><attributen><code>01.61.10</code><naam>Aanduiding naamgebruik</naam></attributen><attributen><code>01.81.10</code><naam>Registergemeente akte waaraan </naam></attributen><attributen><code>01.81.20</code><naam>Aktenummer van de akte waaraan</naam></attributen><attributen><code>01.82.10</code><naam>Gemeente waar de gegevens over</naam></attributen><attributen><code>01.82.20</code><naam>Datum van de ontlening van de </naam></attributen><attributen><code>01.82.30</code><naam>Beschrijving van het document </naam></attributen><attributen><code>01.83.10</code><naam>Aanduiding gegevens in onderzo</naam></attributen><attributen><code>01.83.20</code><naam>Datum ingang onderzoek</naam></attributen><attributen><code>01.83.30</code><naam>Datum einde onderzoek</naam></attributen><attributen><code>01.84.10</code><naam>Indicatie onjuist dan wel stri</naam></attributen><attributen><code>01.85.10</code><naam>Ingangsdatum geldigheid met be</naam></attributen><attributen><code>01.86.10</code><naam>Datum van opneming met betrekk</naam></attributen></objectInfo></getObjectInfoResponse></soapenv:Body></soapenv:Envelope>
